{
    "intents": [
        {
            "tag": "salam",
            "patterns": [
                "Halo",
                "Hai",
                "Selamat pagi",
                "Halo, Apa kabar?",
                "Hai, Apa kabar?"
            ],
            "responses": [
                "Halo! Selamat datang di Klinik Kulit Sehat. Bagaimana saya bisa membantu Anda hari ini?",
                "Hai! Apa yang dapat kami lakukan untuk membantu perawatan kulit wajah Anda?",
                "Selamat pagi! Kami siap membantu Anda dengan perawatan kulit wajah terbaik."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Terima kasih",
                "Makasih",
                "Salam terima kasih",
                "Thanks"
            ],
            "responses": [
                "Sama-sama! Jangan ragu untuk bertanya jika ada yang perlu Anda ketahui tentang perawatan kulit wajah.",
                "Terima kasih kembali! Kami selalu siap membantu perawatan kulit Anda.",
                "Tidak ada masalah. Kami ada di sini untuk membantu perawatan kulit wajah Anda.",
                "Terima kasih atas apresiasi Anda! Kami selalu siap memberikan informasi yang berguna."
            ]
        },
        {
            "tag": "informasi",
            "patterns": [
                "Tips perawatan kulit wajah",
                "Produk perawatan kulit",
                "Cara merawat kulit wajah yang baik"
            ],
            "responses": [
                "Tentu, berikut beberapa tips perawatan kulit wajah yang baik: 1) Bersihkan wajah secara teratur. 2) Gunakan produk perawatan kulit yang sesuai dengan jenis kulit Anda. 3) Lindungi kulit dari sinar matahari. 4) Perbanyak konsumsi air dan makan makanan sehat. 5) Istirahat yang cukup. Apakah Anda ingin informasi lebih lanjut?",
                "Kami memiliki berbagai produk perawatan kulit yang dapat membantu Anda. Produk-produk kami dirancang khusus untuk menjaga kulit wajah Anda tetap sehat dan cantik. Apakah Anda tertarik untuk melihat daftar produk kami?",
                "Cara merawat kulit wajah yang baik melibatkan langkah-langkah seperti membersihkan, menghidrasi, dan melindungi kulit Anda. Kami dapat memberikan panduan rinci jika Anda mau. Ada yang bisa kami bantu?"
            ]
        },
        {
            "tag": "perawatan_malam",
            "patterns": [
                "Rutinitas perawatan kulit malam",
                "Apa yang sebaiknya saya lakukan sebelum tidur?",
                "Produk perawatan kulit malam"
            ],
            "responses": [
                "Rutinitas perawatan kulit malam sangat penting. Ini melibatkan langkah-langkah seperti membersihkan wajah, mengaplikasikan pelembap, dan menggunakan produk perawatan khusus sesuai kebutuhan kulit Anda. Kami dapat memberikan panduan lebih rinci jika Anda mau.",
                "Untuk menjaga kulit wajah Anda tetap sehat, rutinitas perawatan kulit malam adalah kunci. Apakah Anda ingin tahu lebih banyak tentang produk yang cocok untuk perawatan malam?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Sampai jumpa",
                "Selamat tinggal",
                "Terima kasih atas bantuannya"
            ],
            "responses": [
                "Sampai jumpa! Semoga Anda memiliki kulit wajah yang sehat dan cantik. Jangan ragu untuk kembali jika ada pertanyaan lain terkait perawatan kulit.",
                "Selamat tinggal! Jika Anda perlu bantuan lebih lanjut, kami selalu siap membantu. Perawatan kulit yang baik adalah investasi untuk masa depan.",
                "Terima kasih atas apresiasi Anda! Kami senang dapat membantu Anda dengan perawatan kulit wajah Anda."
            ]
        }
    ]
}
